DataProcessors/ПриемкаКоллективная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПриемкаКоллективная</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЯчейкаПриемки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаПриемкиГУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСкладскогоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументГУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоставкаОтВнешнегоПоставщика</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьСостояниеКодаВЧЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьСоответствиеКодаТоваруПоGTIN</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьПриниматьКМБезПроверкиСостояния</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СверятьКодыСОжидаемымиПриПриемке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширеннаяПроверкаВалидностиКодовМаркировкиЧЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ПриемкаКоллективная/Forms/ФормаНеРазмещенныхМаркировок/Ext/Form/Module.bsl
&НаКлиенте
Процедура РазместитьМаркировки(Команда)
	
	СписокПараметров = Новый Структура;
	СписокПараметров.Вставить("ДокументГУИД", Параметры.ДокументГУИД);
	Закрыть( СписокПараметров );	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	РезультатСтруктура = ОбщегоНазначения.ПолучитьСписокМаркировокПоПТУ(Параметры.ДокументГУИД);
	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
		Закрыть();	
		Возврат;
	КонецЕсли; 
	
	Оповестить("ОбновлениеДанных");
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Объект.ОписаниеДокумента = Параметры.НомерДокументаОоформление;
	
	Сообщение = "По данному документу система ";
	Сообщение = Сообщение + "обнаружила ранее размещенные Вами маркировки ,";
	Сообщение = Сообщение + " которые не были отражены в документе ";
	Сообщение = Сообщение + """Поступление товаров и услуг"". ";
	Сообщение = Сообщение + "Нажмите на кнопку ""Разместить маркировки"" ";

	ЭтаФорма.Объект.ТекстСообщения = Сообщение;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновлениеДанных" Тогда
		Элементы.СписокТоваровВБуфереМаркировок.Обновить();
	КонецЕсли; 
	
КонецПроцедуры
